<a href="https://colab.research.google.com/github/cjakuc/Ashrae_Energy_Kaggle_Comp/blob/master/module3-ridge-regression/LS_DS_213_assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 2, Sprint 1, Module 3*

---

# Ridge Regression

## Assignment

We're going back to our other **New York City** real estate dataset. Instead of predicting apartment rents, you'll predict property sales prices.

But not just for condos in Tribeca...

- [x] Use a subset of the data where `BUILDING_CLASS_CATEGORY` == `'01 ONE FAMILY DWELLINGS'` and the sale price was more than 100 thousand and less than 2 million.
- [x] Do train/test split. Use data from January â€”Â March 2019 to train. Use data from April 2019 to test.
- [x] Do one-hot encoding of categorical features.
- [x] Do feature selection with `SelectKBest`.
- [x] Fit a ridge regression model with multiple features. Use the `normalize=True` parameter (or do [feature scaling](https://scikit-learn.org/stable/modules/preprocessing.html) beforehand â€”Â use the scaler's `fit_transform` method with the train set, and the scaler's `transform` method with the test set)
- [x] Get mean absolute error for the test set.
- [x] As always, commit your notebook to your fork of the GitHub repo.

The [NYC Department of Finance](https://www1.nyc.gov/site/finance/taxes/property-rolling-sales-data.page) has a glossary of property sales terms and NYC Building Class Code Descriptions. The data comes from the [NYC OpenData](https://data.cityofnewyork.us/browse?q=NYC%20calendar%20sales) portal.


## Stretch Goals

Don't worry, you aren't expected to do all these stretch goals! These are just ideas to consider and choose from.

- [ ] Add your own stretch goal(s) !
- [x] Instead of `Ridge`, try `LinearRegression`. Depending on how many features you select, your errors will probably blow up! ðŸ’¥
- [x] Instead of `Ridge`, try [`RidgeCV`](https://scikit-learn.org/stable/modules/generated/sklearn.linear_model.RidgeCV.html).
- [ ] Learn more about feature selection:
    - ["Permutation importance"](https://www.kaggle.com/dansbecker/permutation-importance)
    - [scikit-learn's User Guide for Feature Selection](https://scikit-learn.org/stable/modules/feature_selection.html)
    - [mlxtend](http://rasbt.github.io/mlxtend/) library
    - scikit-learn-contrib libraries: [boruta_py](https://github.com/scikit-learn-contrib/boruta_py) & [stability-selection](https://github.com/scikit-learn-contrib/stability-selection)
    - [_Feature Engineering and Selection_](http://www.feat.engineering/) by Kuhn & Johnson.
- [ ] Try [statsmodels](https://www.statsmodels.org/stable/index.html) if youâ€™re interested in more inferential statistical approach to linear regression and feature selection, looking at p values and 95% confidence intervals for the coefficients.
- [ ] Read [_An Introduction to Statistical Learning_](http://faculty.marshall.usc.edu/gareth-james/ISL/ISLR%20Seventh%20Printing.pdf), Chapters 1-3, for more math & theory, but in an accessible, readable way.
- [ ] Try [scikit-learn pipelines](https://scikit-learn.org/stable/modules/compose.html).

In [0]:
%%capture
import sys

# If you're on Colab:
if 'google.colab' in sys.modules:
    DATA_PATH = 'https://raw.githubusercontent.com/LambdaSchool/DS-Unit-2-Applied-Modeling/master/data/'
    !pip install category_encoders==2.*

# If you're working locally:
else:
    DATA_PATH = '../data/'
    
# Ignore this Numpy warning when using Plotly Express:
# FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
import warnings
warnings.filterwarnings(action='ignore', category=FutureWarning, module='numpy')

In [2]:
import pandas as pd
import pandas_profiling

# Read New York City property sales data
df = pd.read_csv(DATA_PATH+'condos/NYC_Citywide_Rolling_Calendar_Sales.csv')

# Change column names: replace spaces with underscores
df.columns = [col.replace(' ', '_') for col in df]

# SALE_PRICE was read as strings.
# Remove symbols, convert to integer
df['SALE_PRICE'] = (
    df['SALE_PRICE']
    .str.replace('$','')
    .str.replace('-','')
    .str.replace(',','')
    .astype(int)
)

# Find out how many observations have a land square feet of '#######'
print((df['LAND_SQUARE_FEET']=='########').value_counts())
# Only 1 out of 23k+ so just drop the row

# Drop the 1 row that has the pound signs
df = (df[df['LAND_SQUARE_FEET']!='########'])
print(df['LAND_SQUARE_FEET'].describe())
print((df['LAND_SQUARE_FEET']=='########').value_counts())

# LAND_SQUARE_FEET was read as strings.
# Remove symbols, convert to integer
df['LAND_SQUARE_FEET'] = (
    df['LAND_SQUARE_FEET']
    .str.replace(',','')
    .astype(float)
)

# Land square feet has a lot of 0s, maybe they are an apartment
# Add that as variable
df['apartment'] = df['LAND_SQUARE_FEET'].apply(lambda x:1 if x==0 else 0)

False    23039
True         1
Name: LAND_SQUARE_FEET, dtype: int64
count     22986
unique     3651
top           0
freq       7500
Name: LAND_SQUARE_FEET, dtype: object
False    23039
Name: LAND_SQUARE_FEET, dtype: int64

In [3]:
# Check that apartment was created correctly
df[['apartment','LAND_SQUARE_FEET']].sample(15)

       apartment  LAND_SQUARE_FEET
8065           0            3100.0
4545           0            1660.0
11229          1               0.0
3045           0            6000.0
8458           0            4000.0
14609          1               0.0
20611          0            1420.0
8014           0            2000.0
13175          0            1958.0
5578           1               0.0
3575           0            4200.0
2333           0            2447.0
2946           0            6300.0
10162          1               0.0
5954           0           11200.0

In [0]:
# BOROUGH is a numeric column, but arguably should be a categorical feature,
# so convert it from a number to a string
df['BOROUGH'] = df['BOROUGH'].astype(str)

In [0]:
# Reduce cardinality for NEIGHBORHOOD feature

# Get a list of the top 10 neighborhoods
top10 = df['NEIGHBORHOOD'].value_counts()[:10].index

# At locations where the neighborhood is NOT in the top 10, 
# replace the neighborhood with 'OTHER'
df.loc[~df['NEIGHBORHOOD'].isin(top10), 'NEIGHBORHOOD'] = 'OTHER'

## 1) Use a subset of the data where BUILDING_CLASS_CATEGORY == '01 ONE FAMILY DWELLINGS' and the sale price was more than 100 thousand and less than 2 million.

In [6]:
condition = ((df['BUILDING_CLASS_CATEGORY']=='01 ONE FAMILY DWELLINGS') &
             (df['SALE_PRICE'] > 100000) &
             (df['SALE_PRICE'] < 2000000))
df = df[condition]
# Check for max/min sale price
print(df.describe())
df.head()

              BLOCK          LOT  ...    SALE_PRICE    apartment
count   3151.000000  3151.000000  ...  3.151000e+03  3151.000000
mean    6917.976515    75.981593  ...  6.285601e+05     0.012694
std     3963.326705   161.089514  ...  2.929904e+05     0.111970
min       21.000000     1.000000  ...  1.040000e+05     0.000000
25%     4016.000000    21.000000  ...  4.475000e+05     0.000000
50%     6301.000000    42.000000  ...  5.680000e+05     0.000000
75%    10208.500000    69.000000  ...  7.600000e+05     0.000000
max    16350.000000  2720.000000  ...  1.955000e+06     1.000000

[8 rows x 13 columns]

    BOROUGH NEIGHBORHOOD  ...   SALE_DATE apartment
44        3        OTHER  ...  01/01/2019         0
61        4        OTHER  ...  01/01/2019         0
78        2        OTHER  ...  01/02/2019         0
108       3        OTHER  ...  01/02/2019         0
111       3        OTHER  ...  01/02/2019         0

[5 rows x 22 columns]

In [7]:
# Check for building class cats
df['BUILDING_CLASS_CATEGORY'].describe()

count                        3151
unique                          1
top       01 ONE FAMILY DWELLINGS
freq                         3151
Name: BUILDING_CLASS_CATEGORY, dtype: object

## 2) Do train/test split. Use data from January â€” March 2019 to train. Use data from April 2019 to test.

In [8]:
# Check that sale date variable is in datetime
df.dtypes
# It is not

BOROUGH                            object
NEIGHBORHOOD                       object
BUILDING_CLASS_CATEGORY            object
TAX_CLASS_AT_PRESENT               object
BLOCK                               int64
LOT                                 int64
EASE-MENT                         float64
BUILDING_CLASS_AT_PRESENT          object
ADDRESS                            object
APARTMENT_NUMBER                   object
ZIP_CODE                          float64
RESIDENTIAL_UNITS                 float64
COMMERCIAL_UNITS                  float64
TOTAL_UNITS                       float64
LAND_SQUARE_FEET                  float64
GROSS_SQUARE_FEET                 float64
YEAR_BUILT                        float64
TAX_CLASS_AT_TIME_OF_SALE           int64
BUILDING_CLASS_AT_TIME_OF_SALE     object
SALE_PRICE                          int64
SALE_DATE                          object
apartment                           int64
dtype: object

In [9]:
# Convert sale dat to datetime
df['SALE_DATE'] = pd.to_datetime(df['SALE_DATE'],
                                 infer_datetime_format=True)
# Check that it worked
df.dtypes

BOROUGH                                   object
NEIGHBORHOOD                              object
BUILDING_CLASS_CATEGORY                   object
TAX_CLASS_AT_PRESENT                      object
BLOCK                                      int64
LOT                                        int64
EASE-MENT                                float64
BUILDING_CLASS_AT_PRESENT                 object
ADDRESS                                   object
APARTMENT_NUMBER                          object
ZIP_CODE                                 float64
RESIDENTIAL_UNITS                        float64
COMMERCIAL_UNITS                         float64
TOTAL_UNITS                              float64
LAND_SQUARE_FEET                         float64
GROSS_SQUARE_FEET                        float64
YEAR_BUILT                               float64
TAX_CLASS_AT_TIME_OF_SALE                  int64
BUILDING_CLASS_AT_TIME_OF_SALE            object
SALE_PRICE                                 int64
SALE_DATE                         datetime64[ns]
apartment                                  int64
dtype: object

In [10]:
df['SALE_DATE'].describe()

count                    3151
unique                     91
top       2019-01-31 00:00:00
freq                       78
first     2019-01-01 00:00:00
last      2019-04-30 00:00:00
Name: SALE_DATE, dtype: object

In [0]:
# Create the train and test splits
cutoff = pd.to_datetime('2019-04-01')
train = df[df['SALE_DATE'] < cutoff]
test = df[df['SALE_DATE'] > cutoff]

## 3) Do one-hot encoding of categorical features.

In [12]:
# Find categorical features with low cardinality
train.describe(exclude='number').T.sort_values(by='unique')

                               count unique  ...      first       last
BUILDING_CLASS_CATEGORY         2507      1  ...        NaT        NaT
APARTMENT_NUMBER                   1      1  ...        NaT        NaT
TAX_CLASS_AT_PRESENT            2507      2  ...        NaT        NaT
BOROUGH                         2507      5  ...        NaT        NaT
NEIGHBORHOOD                    2507      7  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE  2507     11  ...        NaT        NaT
BUILDING_CLASS_AT_PRESENT       2507     13  ...        NaT        NaT
SALE_DATE                       2507     68  ... 2019-01-01 2019-03-30
ADDRESS                         2507   2497  ...        NaT        NaT

[9 rows x 6 columns]

In [13]:
# Find categorical features with high cardinality
train.describe(exclude='number').T.sort_values(by='unique',ascending=False)

                               count unique  ...      first       last
ADDRESS                         2507   2497  ...        NaT        NaT
SALE_DATE                       2507     68  ... 2019-01-01 2019-03-30
BUILDING_CLASS_AT_PRESENT       2507     13  ...        NaT        NaT
BUILDING_CLASS_AT_TIME_OF_SALE  2507     11  ...        NaT        NaT
NEIGHBORHOOD                    2507      7  ...        NaT        NaT
BOROUGH                         2507      5  ...        NaT        NaT
TAX_CLASS_AT_PRESENT            2507      2  ...        NaT        NaT
BUILDING_CLASS_CATEGORY         2507      1  ...        NaT        NaT
APARTMENT_NUMBER                   1      1  ...        NaT        NaT

[9 rows x 6 columns]

In [14]:
train.describe()

              BLOCK          LOT  ...    SALE_PRICE    apartment
count   2507.000000  2507.000000  ...  2.507000e+03  2507.000000
mean    6758.303949    75.778221  ...  6.215737e+05     0.012365
std     3975.909029   157.531138  ...  2.916072e+05     0.110532
min       21.000000     1.000000  ...  1.040000e+05     0.000000
25%     3837.500000    21.000000  ...  4.405000e+05     0.000000
50%     6022.000000    42.000000  ...  5.600000e+05     0.000000
75%     9888.500000    70.000000  ...  7.500000e+05     0.000000
max    16350.000000  2720.000000  ...  1.955000e+06     1.000000

[8 rows x 13 columns]

In [15]:
train.describe(exclude='number')

       BOROUGH NEIGHBORHOOD  ... BUILDING_CLASS_AT_TIME_OF_SALE            SALE_DATE
count     2507         2507  ...                           2507                 2507
unique       5            7  ...                             11                   68
top          4        OTHER  ...                             A1  2019-01-31 00:00:00
freq      1204         2360  ...                            919                   78
first      NaN          NaN  ...                            NaN  2019-01-01 00:00:00
last       NaN          NaN  ...                            NaN  2019-03-30 00:00:00

[6 rows x 9 columns]

In [0]:
# Exclude the features with high cardinality & NaNs
target = 'SALE_PRICE'
exclude = ['ADDRESS',
           'SALE_DATE',
           'APARTMENT_NUMBER',
           'EASE-MENT',
           'BUILDING_CLASS_CATEGORY',
           'TAX_CLASS_AT_TIME_OF_SALE']
features = train.columns.drop([target] + exclude)

In [0]:
# Create feature splits
X_train = train[features]
y_train = train[target]
X_test = test[features]
y_test = test[target]

In [0]:
# Encode categorical features using category encoders
import category_encoders as ce
encoder = ce.OneHotEncoder(use_cat_names=True)
X_train = encoder.fit_transform(X_train)

In [0]:
X_test = encoder.transform(X_test)

In [20]:
X_train.columns

Index(['BOROUGH_3', 'BOROUGH_4', 'BOROUGH_2', 'BOROUGH_5', 'BOROUGH_1',
       'NEIGHBORHOOD_OTHER', 'NEIGHBORHOOD_FLUSHING-NORTH',
       'NEIGHBORHOOD_EAST NEW YORK', 'NEIGHBORHOOD_BEDFORD STUYVESANT',
       'NEIGHBORHOOD_FOREST HILLS', 'NEIGHBORHOOD_BOROUGH PARK',
       'NEIGHBORHOOD_ASTORIA', 'TAX_CLASS_AT_PRESENT_1',
       'TAX_CLASS_AT_PRESENT_1D', 'BLOCK', 'LOT',
       'BUILDING_CLASS_AT_PRESENT_A9', 'BUILDING_CLASS_AT_PRESENT_A1',
       'BUILDING_CLASS_AT_PRESENT_A5', 'BUILDING_CLASS_AT_PRESENT_A0',
       'BUILDING_CLASS_AT_PRESENT_A2', 'BUILDING_CLASS_AT_PRESENT_A3',
       'BUILDING_CLASS_AT_PRESENT_S1', 'BUILDING_CLASS_AT_PRESENT_A4',
       'BUILDING_CLASS_AT_PRESENT_A6', 'BUILDING_CLASS_AT_PRESENT_A8',
       'BUILDING_CLASS_AT_PRESENT_B2', 'BUILDING_CLASS_AT_PRESENT_S0',
       'BUILDING_CLASS_AT_PRESENT_B3', 'ZIP_CODE', 'RESIDENTIAL_UNITS',
       'COMMERCIAL_UNITS', 'TOTAL_UNITS', 'LAND_SQUARE_FEET',
       'GROSS_SQUARE_FEET', 'YEAR_BUILT', 'BUILDING_CLASS_AT_TIME_OF_SALE_A9',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A1',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A5',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A0',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A2',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A3',
       'BUILDING_CLASS_AT_TIME_OF_SALE_S1',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A4',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A6',
       'BUILDING_CLASS_AT_TIME_OF_SALE_A8',
       'BUILDING_CLASS_AT_TIME_OF_SALE_S0', 'apartment'],
      dtype='object')

## 4) Do feature selection with `SelectKBest`.

In [21]:
from sklearn.feature_selection import SelectKBest, f_regression
from sklearn.linear_model import Ridge, LinearRegression
from sklearn.metrics import mean_absolute_error

for k in range(1, len(X_train.columns)+1):
    print(f'{k} features')
    
    selector = SelectKBest(score_func=f_regression, k=k)
    X_train_selected = selector.fit_transform(X_train, y_train)
    X_test_selected = selector.transform(X_test)

    model = LinearRegression()
    model.fit(X_train_selected, y_train)
    y_pred = model.predict(X_test_selected)
    mae = mean_absolute_error(y_test, y_pred)
    print(f'Test Mean Absolute Error: ${mae:,.0f} \n')

1 features
Test Mean Absolute Error: $184,772

2 features
Test Mean Absolute Error: $180,572

3 features
Test Mean Absolute Error: $180,098

4 features
Test Mean Absolute Error: $180,098

5 features
Test Mean Absolute Error: $181,706

6 features
Test Mean Absolute Error: $179,910

7 features
Test Mean Absolute Error: $173,905

8 features
Test Mean Absolute Error: $174,004

9 features
Test Mean Absolute Error: $174,028

10 features
Test Mean Absolute Error: $170,665

11 features
Test Mean Absolute Error: $170,527

12 features
Test Mean Absolute Error: $170,162

13 features
Test Mean Absolute Error: $158,851

14 features
Test Mean Absolute Error: $159,413

15 features
Test Mean Absolute Error: $159,410

16 features
Test Mean Absolute Error: $159,411

17 features
Test Mean Absolute Error: $159,279

18 features
Test Mean Absolute Error: $159,279

19 features
Test Mean Absolute Error: $159,146

20 features
Test Mean Absolute Error: $159,146

21 features
Test Mean Absolute Error: $154,367

22 features
Test Mean Absolute Error: $154,413

23 features
Test Mean Absolute Error: $154,413

24 features
Test Mean Absolute Error: $154,413

25 features
Test Mean Absolute Error: $154,413

26 features
Test Mean Absolute Error: $154,413

27 features
Test Mean Absolute Error: $154,413

28 features
Test Mean Absolute Error: $154,413

29 features
Test Mean Absolute Error: $154,413

30 features
Test Mean Absolute Error: $154,413

31 features
Test Mean Absolute Error: $155,491

32 features
Test Mean Absolute Error: $155,616

33 features
Test Mean Absolute Error: $155,616

34 features
Test Mean Absolute Error: $155,604

35 features
Test Mean Absolute Error: $155,598

36 features
Test Mean Absolute Error: $155,598

37 features
Test Mean Absolute Error: $155,560

38 features
Test Mean Absolute Error: $155,379

39 features
Test Mean Absolute Error: $155,379

40 features
Test Mean Absolute Error: $156,604

41 features
Test Mean Absolute Error: $156,709

42 features
Test Mean Absolute Error: $156,760

43 features
Test Mean Absolute Error: $156,761

44 features
Test Mean Absolute Error: $156,761

45 features
Test Mean Absolute Error: $156,761

46 features
Test Mean Absolute Error: $156,761

47 features
Test Mean Absolute Error: $156,763

48 features
Test Mean Absolute Error: $156,761

## 5) Fit a ridge regression model with multiple features. Use the normalize=True parameter (or do feature scaling beforehand â€” use the scaler's fit_transform method with the train set, and the scaler's transform method with the test set)

In [22]:
from sklearn.linear_model import RidgeCV

alphas = [0.0001, 0.01, 0.001, 0.1, 1.0, 10.0, 100.0]
for k in range(1, len(X_train.columns)+1):
    print(f'{k} features')
    
    # Select the k best features
    selector = SelectKBest(score_func=f_regression,
                           k=k)
    X_train_selected = selector.fit_transform(X_train,
                                              y_train)
    X_test_selected = selector.transform(X_test)

    # Select the best alpha for ridge regression using RidgeCV
    model = RidgeCV(alphas=alphas,
                    normalize=True)
    model.fit(X_train_selected,
              y_train)
    
    # Find the MAE of the model w/ selected alpha and selected k features
    y_pred = model.predict(X_test_selected)
    mae = mean_absolute_error(y_test,
                              y_pred)
    
    # Print selected alpha and test MAE of the model
    print(f'Alpha: {model.alpha_} and Test Mean Absolute Error: ${mae:,.0f} \n')

1 features
Alpha: 0.01 and Test Mean Absolute Error: $184,831

2 features
Alpha: 0.01 and Test Mean Absolute Error: $180,633

3 features
Alpha: 0.01 and Test Mean Absolute Error: $180,152

4 features
Alpha: 0.01 and Test Mean Absolute Error: $180,151

5 features
Alpha: 0.01 and Test Mean Absolute Error: $181,678

6 features
Alpha: 0.01 and Test Mean Absolute Error: $179,829

7 features
Alpha: 0.01 and Test Mean Absolute Error: $173,864

8 features
Alpha: 0.01 and Test Mean Absolute Error: $173,903

9 features
Alpha: 0.01 and Test Mean Absolute Error: $173,916

10 features
Alpha: 0.0001 and Test Mean Absolute Error: $170,674

11 features
Alpha: 0.0001 and Test Mean Absolute Error: $170,528

12 features
Alpha: 0.0001 and Test Mean Absolute Error: $170,160

13 features
Alpha: 0.001 and Test Mean Absolute Error: $158,777

14 features
Alpha: 0.0001 and Test Mean Absolute Error: $159,399

15 features
Alpha: 0.0001 and Test Mean Absolute Error: $159,396

16 features
Alpha: 0.001 and Test Mean Absolute Error: $159,286

17 features
Alpha: 0.001 and Test Mean Absolute Error: $159,157

18 features
Alpha: 0.001 and Test Mean Absolute Error: $159,156

19 features
Alpha: 0.001 and Test Mean Absolute Error: $159,020

20 features
Alpha: 0.001 and Test Mean Absolute Error: $159,020

21 features
Alpha: 0.001 and Test Mean Absolute Error: $154,257

22 features
Alpha: 0.001 and Test Mean Absolute Error: $154,315

23 features
Alpha: 0.001 and Test Mean Absolute Error: $154,318

24 features
Alpha: 0.001 and Test Mean Absolute Error: $154,318

25 features
Alpha: 0.001 and Test Mean Absolute Error: $154,324

26 features
Alpha: 0.001 and Test Mean Absolute Error: $154,324

27 features
Alpha: 0.001 and Test Mean Absolute Error: $154,325

28 features
Alpha: 0.001 and Test Mean Absolute Error: $154,325

29 features
Alpha: 0.001 and Test Mean Absolute Error: $154,325

30 features
Alpha: 0.001 and Test Mean Absolute Error: $154,325

31 features
Alpha: 0.001 and Test Mean Absolute Error: $155,405

32 features
Alpha: 0.001 and Test Mean Absolute Error: $155,529

33 features
Alpha: 0.001 and Test Mean Absolute Error: $155,529

34 features
Alpha: 0.001 and Test Mean Absolute Error: $155,503

35 features
Alpha: 0.001 and Test Mean Absolute Error: $155,498

36 features
Alpha: 0.001 and Test Mean Absolute Error: $155,498

37 features
Alpha: 0.001 and Test Mean Absolute Error: $155,461

38 features
Alpha: 0.001 and Test Mean Absolute Error: $155,273

39 features
Alpha: 0.001 and Test Mean Absolute Error: $155,273

40 features
Alpha: 0.001 and Test Mean Absolute Error: $156,483

41 features
Alpha: 0.001 and Test Mean Absolute Error: $156,587

42 features
Alpha: 0.01 and Test Mean Absolute Error: $155,874

43 features
Alpha: 0.001 and Test Mean Absolute Error: $156,643

44 features
Alpha: 0.001 and Test Mean Absolute Error: $156,638

45 features
Alpha: 0.001 and Test Mean Absolute Error: $156,638

46 features
Alpha: 0.001 and Test Mean Absolute Error: $156,638

47 features
Alpha: 0.001 and Test Mean Absolute Error: $156,637

48 features
Alpha: 0.001 and Test Mean Absolute Error: $156,675